{
    "uri": "7388484030",
    "lang": "eng",
    "isDuplicate": false,
    "date": "2023-02-07",
    "time": "12:35:00",
    "dateTime": "2023-02-07T12:35:00Z",
    "dateTimePub": "2023-02-07T12:33:00Z",
    "dataType": "news",
    "sim": 0.4745098054409027,
    "url": "https://www.dailymail.co.uk/news/article-11722029/Will-Turkish-flights-cancelled-affect-holiday-Brits-need-know.html",
    "title": "Turkey earthquake: Will flights be cancelled, will it affect holidays?",
    "body": "The country has been devastated by three earthquakes, with over 5,000 dead\n\nBritish holidaymakers travelling to Turkey are being advised to check with their airlines after three devastating earthquakes.\n\nMore than 5,000 people have been killed since the first quake struck yesterday. A third 5.8-magnitude quake struck at a depth of 1.2 miles in southeastern Turkey this morning, the European Mediterranean Seismological Centre (EMSC) said.\n\nIn Turkey alone, the death toll has passed 3,400 - while neighbouring Syria has also reported a humanitarian crisis.\n\nTens of thousands have been left homeless and sleeping in their cars or searching for temporary accommodation after thousands of buildings were brought down on both sides of the border.\n\nThe WHO has warned that the death toll could rise to over 20,000 - with fears victims trapped under rubble could succumb to freezing overnight temperatures of -5C (23F).\n\nBritish holidaymakers' chief hotspots are located on the country's western Mediterranean coast, hundreds of miles away from the epicentre of the quake\n\nA man runs along a street strewn with debris, in Hatay, after a 7.8-magnitude earthquake struck the country's southeast region\n\nHugh Fraser, Founder of Corinthian Travel which offers upmarket private tours to Turkey, told MailOnline: 'Southeastern Turkey and the area in the vicinity of Gaziantep, has many spectacular attractions and is noted for its delicious regional cuisine, but has traditionally been the preserve of the second or third-time cultural visitors to Turkey.\n\n'The earthquake is a human tragedy but it is unlikely to have much impact on Turkey's major centres of tourism - Istanbul, Cappadocia, and the Aegean Coast - all of which are located hundreds of miles away to the west.'\n\nWhere have the earthquakes hit?\n\nAll three quakes occurred in Turkey's south eastern Anatolia region, close to its border with Syria.\n\nREAD MORE: WHERE WAS EPICENTRE OF 7.8 MAGNITUDE TREMOR?\n\nAdvertisement\n\nA 7.8 earthquake hit Gaziantep and nine other Turkish provinces (Hatay, Osmaniye, Adıyaman, Diyarbakır, Sanliurfa, Kahramanmaras, Kilis, Adana, Malatya) in the south east of Turkey yesterday morning at 4.17am.\n\nIt was followed just hours later by a 7.5 earthquake which broke out in Kahramanmaras, near the town of Ekinozu, around 180km (111 miles) northwest of the first fissure.\n\nEarly this morning, a third 5.8-magnitude quake struck the region at a depth of 1.2 miles\n\nWhat the UK Foreign Office said\n\nForeign Secretary James Cleverly stated: 'The UK is sending immediate support to Türkiye including a team of 76 search & rescue specialists, equipment and rescue dogs.\n\n'In Syria, the UK-funded White Helmets have mobilised their resources to respond. We stand ready to provide further support as needed.'\n\nUK holidaymakers travelling to Turkey are advised to avoid the southeast region and contact their tour operator or local authorities but the Foreign Office has not issued any restrictions against travel.\n\nThe Foreign Office has longstanding travel advice against all but essential journeys to Sirnak and the province of Hakkari, in the disputed region.\n\nOne customer who contacted British Airways seeking to cancel his flight to Istanbul was told to speak to his travel insurance provider, as the airline was still carrying flights as usual\n\nForeign Secretary James Cleverly tweeted: 'The UK is sending immediate support to Türkiye including a team of 76 search & rescue specialists, equipment and rescue dogs'\n\nA man sits on the rubble of a collapsed buildings in Kahramanmaras, close to the quake's epicentre\n\nA man walks solemnly near a collapsed building after 7.7 and 7.6 magnitude earthquakes hit Hatay yesterday\n\nCivilians look for survivors under the rubble of collapsed buildings in Kahramanmaras\n\nStray pets are seen near collapsed buildings after three large earthquakes caused devastation in southeastern Turkey\n\nWhere are the popular British holiday destinations in Turkey?\n\nREAD MORE: UN SAYS 'THOUSANDS OF CHILDREN' LIKELY DEAD IN TURKEY\n\nAdvertisement\n\nBritons made over three million trips to Turkey last year and despite longstanding guidance to avoid regions within 10km of the Syrian border, nearly all holidays were trouble-free.\n\nThe most popular British holiday destinations of Çeşme, Didim, Fethiye, Marmaris, Bodrum and Antalya are located on Turkey's western Mediterranean coast, over 1,000km (621 miles) away from the epicentre of the quakes.\n\nBritons wishing to cancel their flights are advised to contact their operators to find out about their policies; and whether they are entitled to a refund.\n\nIs travel likely to be affected?\n\nNo airlines serving UK flights into Turkey have reported cancellations. There are currently no flights to Adana, located 220km west of Gazientep, however domestic flights from the popular airports of Istanbul and Bodrum are available.\n\nThe three airports closest to the scene of the disaster - Gazientep Airport, Hatay Airport and Ceyhan - are closed from operations, Crisis 24 reports.\n\n'Currently, only planes carrying aid and rescue teams are allowed to land and take off from the two airports,' Turkish newspaper the Daily Sabah reported. 'Hatay Airport, whose runway was damaged because of the earthquake, was closed for all flights.'\n\nOne customer who contacted British Airways seeking to cancel his flight to Istanbul was told to speak to his insurance, as the airline was still carrying flights as usual.\n\nWhy did it happen?\n\nCatastrophic earthquakes are caused when two tectonic plates that are sliding in opposite directions stick and then slip suddenly.\n\nThey are composed of Earth's crust and the uppermost portion of the mantle, while below is the asthenosphere: the warm, viscous conveyor belt of rock on which tectonic plates ride.\n\nThey do not all move in the same direction and often clash, which builds up a huge amount of pressure between the two plates.\n\nEventually, this pressure causes one plate to jolt either under or over the other.\n\nThis releases a huge amount of energy, creating tremors and destruction to any property or infrastructure nearby.\n\nSevere earthquakes normally occur over fault lines where tectonic plates meet, but minor tremors - which still register on the Richter sale - can happen in the middle of these plates.\n\nEarthquakes are detected by tracking the size, or magnitude, and intensity of the shock waves they produce, known as seismic waves.\n\nThe magnitude of an earthquake differs from its intensity, as the former refers to the measurement of energy released where the earthquake originated.\n\nIntensity relates to the size of the seismic waves recorded by a seismograph during the event.",
    "source": {
        "uri": "dailymail.co.uk",
        "dataType": "news",
        "title": "Daily Mail Online"
    },
    "authors": [],
    "image": "https://i.dailymail.co.uk/1s/2023/02/07/12/67413589-0-image-a-10_1675772903361.jpg",
    "eventUri": "eng-8380242",
    "sentiment": -0.4745098039215686,
    "wgt": 25,
    "relevance": 25
}